In [9]:
import pandas as pd
import numpy as np

In [10]:
df = pd.read_csv("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/ex1.csv")

In [11]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
!type C:\Users\safye\Downloads\pydata-book-3rd-edition\pydata-book-3rd-edition\examples\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [13]:
!type "C:\Users\safye\Downloads\pydata-book-3rd-edition\pydata-book-3rd-edition\examples\ex2.csv"

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [14]:
pd.read_csv("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/ex2.csv", header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [15]:
pd.read_csv("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/ex2.csv", names=["a", "b", "c", "d", "message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
names = ["a", "b", "c", "d", "message"]
pd.read_csv("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/ex2.csv", names=names, index_col="message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [17]:
df = pd.read_csv("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/csv_mindex.csv")

In [18]:
df

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [19]:
parsed = pd.read_csv("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/csv_mindex.csv", index_col=["key1", "key2"])

In [20]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [21]:
parsed = pd.read_csv("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/csv_mindex.csv", index_col=["key2", "key1"])

In [22]:
parsed

           value1  value2
key2 key1
a    one        1       2
b    one        3       4
c    one        5       6
d    one        7       8
a    two        9      10
b    two       11      12
c    two       13      14
d    two       15      16

In [23]:
!type C:\Users\safye\Downloads\pydata-book-3rd-edition\pydata-book-3rd-edition\examples\ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [24]:
!type C:\Users\safye\Downloads\pydata-book-3rd-edition\pydata-book-3rd-edition\examples\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [25]:
parsed = pd.read_csv("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/ex4.csv")

In [26]:
parsed

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [27]:
df = pd.read_csv("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/ex4.csv", skiprows=[0, 2, 3])

In [28]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [29]:
!type C:\Users\safye\Downloads\pydata-book-3rd-edition\pydata-book-3rd-edition\examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [30]:
parsed = pd.read_csv("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/ex5.csv")

In [31]:
parsed

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [32]:
pd.isna(parsed)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [33]:
pd.isnull(parsed)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [34]:
result2 = pd.read_csv("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/ex5.csv", keep_default_na=False)

In [35]:
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [36]:
pd.isna(result2)

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [37]:
result3 = pd.read_csv("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/ex5.csv", keep_default_na=False, na_values=["NA"])

In [38]:
result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [39]:
result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [40]:
pd.isna(result3)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [41]:
pd.options.display.max_rows = 10

In [42]:
result = pd.read_csv("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/ex6.csv")

In [43]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [44]:
pd.read_csv("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/ex6.csv", nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [45]:
data = pd.read_csv("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/ex5.csv")

In [46]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [47]:
data.to_csv("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/out.csv")

In [48]:
!type C:\Users\safye\Downloads\pydata-book-3rd-edition\pydata-book-3rd-edition\examples\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [49]:
import sys
data.to_csv(sys.stdout, sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [50]:
data.to_csv(sys.stdout, na_rep="boÅŸ")

,something,a,b,c,d,message
0,one,1,2,3.0,4,boÅŸ
1,two,5,6,boÅŸ,8,world
2,three,9,10,11.0,12,foo

In [51]:
!type C:\Users\safye\Downloads\pydata-book-3rd-edition\pydata-book-3rd-edition\examples\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [52]:
import csv
f = open("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/ex7.csv")
reader = csv.reader(f)

In [53]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [54]:
f.close()

In [55]:
with open ("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/ex7.csv") as f:
    lines = list(csv.reader(f))

In [56]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [57]:
header, values = lines[0], lines[1:]

In [58]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [59]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [67]:
cities_lived = pd.Series(result["cities_lived"])
cities_lived

0            Akron
1        Nashville
2         New York
3    San Francisco
dtype: object

In [60]:
type(result)

dict

In [61]:
type(obj)

str

In [62]:
asjson = json.dumps(result)
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [63]:
type(asjson)

str

In [64]:
siblings = pd.DataFrame(result["siblings"], columns=["name", "age"])
siblings

    name  age
0  Scott   34
1  Katie   42

In [68]:
!type C:\Users\safye\Downloads\pydata-book-3rd-edition\pydata-book-3rd-edition\examples\example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [70]:
data = pd.read_json("C:/Users/safye/Downloads/pydata-book-3rd-edition/pydata-book-3rd-edition/examples/example.json")

In [71]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9